src/server/api_ihrmis/app/Http/Controllers/PersonController.php

    public function getPerson() {
>>>>>>> 2215c9adb1b325f735f0ec810bc4a6a00ae0bf7f
        $qryPerson = Person::get();
---
select * from `person`