src/server/api_ihrmis/app/Http/Controllers/API/AuthController.php

    public function login(Request $request){

        $authUser = User::where('username', $request['username'])->firstOrFail();
        $request->merge(['email' => $authUser->email]);

        if (!Auth::attempt($request->only('email', 'password')))
        {
            return response()->json(['message' => 'Invalid Credentials'], 401);
        }

        $user = User::where('email', $request['email'])->firstOrFail();
---
select * from `users` where `username` = 'aga' limit 1
select * from `users` where `email` = 'agaalmiranez13@gmail.com' limit 1